wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_can.c
    /* read FIFO descriptor 0 */
    *rx_fifo_addr = *((uint32_t *)can_mb );
    rx_fifo->id = *((uint32_t *)((uint32_t)(can_mb + 0x04U)));
    rx_fifo->data[0] = *((uint32_t *)((uint32_t)(can_mb + 0x08U)));
    rx_fifo->data[1] = *((uint32_t *)((uint32_t)(can_mb + 0x0CU)));

    /* clear FIFO status */
    CAN_STAT(can_periph) = CAN_STAT_MS5_RFNE;

    /* read FIFO id field */
    if(rx_fifo->ide) {
        rx_fifo->id = GET_FDES1_ID_EXD(rx_fifo->id);
    } else {
        rx_fifo->id = GET_FDES1_ID_STD(rx_fifo->id);
    }

    /* read FIFO data */
    can_data_to_little_endian_swap(rx_fifo->data, rx_fifo->data, rx_fifo->dlc);
}

/*!
    \brief      get rx FIFO filter matching number
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     filter number
*/
uint32_t can_rx_fifo_filter_matching_number_get(uint32_t can_periph)
{
    return GET_RFIFOIFMN_IDFMN(CAN_RFIFOIFMN(can_periph));
}

/*!
    \brief      clear rx FIFO
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_rx_fifo_clear(uint32_t can_periph)
{
    CAN_STAT(can_periph) = CAN_STAT_MS0_RFC;
}

/*!
    \brief      get mailbox RAM address
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index, 0-31
    \param[out] none
    \retval     pointer to the mailbox address
*/
uint32_t can_ram_address_get(uint32_t can_periph, uint32_t index)
{
    uint32_t payload_size;
    uint32_t address;

    /* if CAN FD mode is enabled */
    if(CAN_CTL0(can_periph) & CAN_CTL0_FDEN) {
        payload_size = (uint32_t)1U << (GET_FDCTL_MDSZ(CAN_FDCTL(can_periph)) + 3U);
    } else {
        payload_size = 8U;
    }
    address = (uint32_t)(CAN_RAM(can_periph) + (payload_size + 8U) * index);

    return address;
}

/*!
    \brief      configure mailbox
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[in]  mdpara: mailbox descriptor struct
                  timestamp: 0 - 0xFFFF
                  dlc: 0 - 0xF
                  rtr: 0, 1
                  ide: 0, 1
                  srr: 0, 1
                  code: CAN_MB_RX_STATUS_INACTIVE, CAN_MB_RX_STATUS_FULL, CAN_MB_RX_STATUS_EMPTY,
                        CAN_MB_RX_STATUS_OVERRUN, CAN_MB_RX_STATUS_RANSWER, CAN_MB_RX_STATUS_BUSY,
                        CAN_MB_TX_STATUS_INACTIVE, CAN_MB_TX_STATUS_ABORT, CAN_MB_TX_STATUS_DATA
                  esi: 0, 1
                  brs: 0, 1
                  fdf: 0, 1
                  id: 0 - 0x1FFFFFFF
                  prio: 0 - 7
                  data_bytes: 0 - 64
                  data[64]: data
                  padding: FD mode padding data
    \param[out] none
    \retval     none
*/
void can_mailbox_config(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    uint32_t dlc;
    uint32_t mdes0 = 0U;
    uint32_t mdes1 = 0U;
    uint32_t mdes2 = 0U;
    uint32_t mdes3 = 0U;
    uint32_t length;
    uint32_t mdes;

    /* clear mailbox status */
    CAN_STAT(can_periph) = STAT_MS(index);

    /* get mailbox base address */
    mdes = can_ram_address_get(can_periph, index);
    mdes1 = mdes + 0x04U;
    mdes2 = mdes + 0x08U;
    mdes3 = mdes + 0x0CU;
    *(uint32_t *)mdes = 0U;
    *(uint32_t *)mdes1 = 0U;
    *(uint32_t *)mdes2 = 0U;
    *(uint32_t *)mdes3 = 0U;
    /* set RTR bit */
    if(mdpara->rtr) {
        mdes0 |= CAN_MDES0_RTR;
    }

    /* set IDE bit and ID field */
    if(mdpara->ide) {
        mdes0 |= CAN_MDES0_IDE;
        mdes0 |= CAN_MDES0_SRR;
        *(uint32_t *)mdes1 |= MDES1_ID_EXD(mdpara->id);
    } else {
        *(uint32_t *)mdes1 |= MDES1_ID_STD(mdpara->id);
    }

    /* set CODE field */
    mdes0 |= MDES0_CODE(mdpara->code);

    if(mdpara->code != CAN_MB_RX_STATUS_EMPTY) {
        /* copy user's buffer into the mailbox data area */
        if(mdpara->data_bytes) {
            dlc = can_dlc_value_compute(mdpara->data_bytes);
            mdes0 |= MDES0_DLC(dlc);
            length = (uint32_t)1U << (GET_FDCTL_MDSZ(CAN_FDCTL(can_periph)) + 3U);
            if(mdpara->data_bytes < length) {
                length = mdpara->data_bytes;
            }
            can_data_to_big_endian_swap((uint32_t *)mdes2, (uint32_t *)mdpara->data, length);
        }

        /* prepare mailbox for transmission */
        if(CAN_MB_TX_STATUS_DATA == mdpara->code) {
            /* set ESI bit */
            if(mdpara->esi) {
                mdes0 |= CAN_MDES0_ESI;
            }
            /* set FDF and BRS bit */
            if(mdpara->fdf) {
                mdes0 |= CAN_MDES0_FDF;
                if(mdpara->brs) {
                    mdes0 |= CAN_MDES0_BRS;
                }
                mdes0 &= ~CAN_MDES0_RTR;
            }
        }

        /* set PRIO field */
        *(uint32_t *)mdes1 |= MDES1_PRIO(mdpara->prio);
    }

    /* set mailbox descriptor 0 */
   *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      abort mailbox transmit
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_transmit_abort(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

    /* abort transmit mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_TX_STATUS_ABORT);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      inactive transmit mailbox
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_transmit_inactive(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

    /* inactive transmit mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_TX_STATUS_INACTIVE);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      read receive mailbox data
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] mdpara: mailbox descriptor struct
    \retval     ERROR or SUCCESS
*/
ErrStatus can_mailbox_receive_data_read(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    ErrStatus status = ERROR;
    uint32_t i;
    uint32_t cnt;
    uint32_t timeout;
    uint32_t mdes = can_ram_address_get(can_periph, index);
    uint32_t *mdaddr = (uint32_t *)mdpara;
    uint32_t mdes1 = 0U;

    /* wait mailbox data ready */
    timeout = CAN_DELAY;
    while(((*(uint32_t *)mdes) & MDES0_CODE(CAN_MB_RX_STATUS_BUSY)) && (timeout)) {
        timeout--;
    }
    if((*(uint32_t *)mdes) & MDES0_CODE(CAN_MB_RX_STATUS_BUSY)) {
        status = ERROR;
    } else {
        /* get mailbox descriptor 0 */
        *mdaddr = *(uint32_t *)mdes;
        mdes1 = *(uint32_t *)((uint32_t)(mdes + 0x04U));
        mdpara->id = (mdes1 & 0x1FFFFFFFU);
        mdpara->prio = (mdes1 & 0xE0000000U) >> 29U;
        mdpara->data_bytes = can_payload_size_compute(*mdaddr);
        cnt = (mdpara->data_bytes + 3U) / 4U;
        mdes = mdes + 0x08U;
        for(i = 0U; i < cnt; i++) {
            *((uint32_t *)(&mdpara->data[i * 4U])) = *(uint32_t *)mdes;
            mdes = mdes + 4U;
        }

