wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_can.c
        /* clear mailbox status */
        CAN_STAT(can_periph) = STAT_MS(index);
        /* unlock mailbox */
        CAN_TIMER(can_periph);

        /* get mailbox ID */
        if(mdpara->ide) {
            mdpara->id = GET_MDES1_ID_EXD(mdpara->id);
        } else {
            mdpara->id = GET_MDES1_ID_STD(mdpara->id);
        }

        /* get mailbox data */
        if(mdpara->data_bytes) {
            can_data_to_little_endian_swap((uint32_t *)mdpara->data, (uint32_t *)mdpara->data, mdpara->data_bytes);
        }
        status = SUCCESS;
    }
    return status;
}

/*!
    \brief      lock the receive mailbox
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_lock(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes;

    mdes = can_ram_address_get(can_periph, index);
    REG32(mdes);
}

/*!
    \brief      unlock the receive mailbox
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_unlock(uint32_t can_periph)
{
    CAN_TIMER(can_periph);
}

/*!
    \brief      inactive the receive mailbox
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_inactive(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

    /* inactive receive mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_RX_STATUS_INACTIVE);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      get mailbox code value
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index(0~31)
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     mailbox code
*/
uint32_t can_mailbox_code_get(uint32_t can_periph, uint32_t index)
{
    uint32_t code;
    uint32_t mdes;

    mdes = can_ram_address_get(can_periph, index);
    code = GET_MDES0_CODE(*(uint32_t *)mdes);

    return code;
}

/*!
    \brief      configure error counter
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  errcnt_struct
                  fd_data_phase_rx_errcnt: 0-255
                  fd_data_phase_tx_errcnt: 0-255
                  rx_errcnt: 0-255
                  tx_errcnt: 0-255
    \param[out] none
    \retval     none
*/
void can_error_counter_config(uint32_t can_periph, can_error_counter_struct *errcnt_struct)
{
    CAN_ERR0(can_periph) = ERR0_REFCNT(errcnt_struct->fd_data_phase_rx_errcnt) | ERR0_TEFCNT(errcnt_struct->fd_data_phase_tx_errcnt) | \
                           ERR0_RECNT(errcnt_struct->rx_errcnt) | ERR0_TECNT(errcnt_struct->tx_errcnt);
}

/*!
    \brief      get error counter
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] errcnt_struct
                  fd_data_phase_rx_errcnt: 0-255
                  fd_data_phase_tx_errcnt: 0-255
                  rx_errcnt: 0-255
                  tx_errcnt: 0-255
    \retval     none
*/
void can_error_counter_get(uint32_t can_periph, can_error_counter_struct *errcnt_struct)
{
    uint32_t reg = 0U;

    reg = CAN_ERR0(can_periph);
    errcnt_struct->fd_data_phase_rx_errcnt = (uint8_t)GET_ERR0_REFCNT(reg);
    errcnt_struct->fd_data_phase_tx_errcnt = (uint8_t)GET_ERR0_TEFCNT(reg);
    errcnt_struct->rx_errcnt = (uint8_t)GET_ERR0_RECNT(reg);
    errcnt_struct->tx_errcnt = (uint8_t)GET_ERR0_TECNT(reg);
}

/*!
    \brief      get error state indicator
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     CAN_ERROR_STATE_ACTIVE, CAN_ERROR_STATE_PASSIVE or CAN_ERROR_STATE_BUS_OFF
*/
can_error_state_enum can_error_state_get(uint32_t can_periph)
{
    uint32_t reg;

    reg = GET_ERR1_ERRSI(CAN_ERR1(can_periph));
    if(reg >= (uint32_t)CAN_ERROR_STATE_BUS_OFF) {
        reg = (uint32_t)CAN_ERROR_STATE_BUS_OFF;
    }

    return (can_error_state_enum)reg;
}

/*!
    \brief      get mailbox CRC value
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] crc_struct:
                  classical_frm_mb_number: 0 - 0x1F
                  classical_frm_transmitted_crc: 0 - 0x7FFF
                  classical_fd_frm_mb_number: 0 - 0x1F
                  classical_fd_frm_transmitted_crc: 0 - 0x1FFFFF
    \retval     none
*/
void can_crc_get(uint32_t can_periph, can_crc_struct *crc_struct)
{
    uint32_t reg1 = 0U, reg2 = 0U;

    reg1 = CAN_CRCC(can_periph);
    reg2 = CAN_CRCCFD(can_periph);
    crc_struct->classical_frm_mb_number = GET_CRCC_ANTM(reg1);
    crc_struct->classical_frm_transmitted_crc = GET_CRCC_CRCTC(reg1);
    crc_struct->classical_fd_frm_mb_number = GET_CRCCFD_ANTM(reg2);
    crc_struct->classical_fd_frm_transmitted_crc = GET_CRCCFD_CRCTCI(reg2);
}

/*!
    \brief      configure Pretended Networking mode parameter
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  pnmod_config: Pretended Networking mode config struct
                  timeout_int: ENABLE, DISABLE
                  match_int: ENABLE, DISABLE
                  num_matches: 1 ~ 255
                  match_timeout: 0 ~ 0xFFFF
                  frame_filter: CAN_PN_FRAME_FILTERING_ID, CAN_PN_FRAME_FILTERING_ID_DATA
                                CAN_PN_FRAME_FILTERING_ID_NMM, CAN_PN_FRAME_FILTERING_ID_DATA_NMM
                  id_filter: CAN_PN_ID_FILTERING_EXACT, CAN_PN_ID_FILTERING_GREATER
                             CAN_PN_ID_FILTERING_SMALLER, CAN_PN_ID_FILTERING_RANGE
                  data_filter: CAN_PN_DATA_FILTERING_EXACT, CAN_PN_DATA_FILTERING_GREATER
                               CAN_PN_DATA_FILTERING_SMALLER, CAN_PN_DATA_FILTERING_RANGE
    \param[out] none
    \retval     none
*/
void can_pn_mode_config(uint32_t can_periph, can_pn_mode_config_struct *pnmod_config)
{
    uint32_t tmp;

    /* configure specific Pretended Networking mode settings */
    tmp = CAN_PN_CTL0(can_periph);
    tmp &= ~(CAN_PN_CTL0_FFT | CAN_PN_CTL0_IDFT | CAN_PN_CTL0_DATAFT |
             CAN_PN_CTL0_NMM | CAN_PN_CTL0_WMIE | CAN_PN_CTL0_WTOIE);
    tmp |= (uint32_t)PN_CTL0_WTOIE(pnmod_config->timeout_int) | PN_CTL0_WMIE(pnmod_config->match_int) | \
           PN_CTL0_NMM(pnmod_config->num_matches) | pnmod_config->data_filter | \
           pnmod_config->id_filter | pnmod_config->frame_filter;

    CAN_PN_CTL0(can_periph) = tmp;

    /* set timeout value */
    CAN_PN_TO(can_periph) &= ~CAN_PN_TO_WTO;
    CAN_PN_TO(can_periph) |= (uint32_t)PN_TO_WTO(pnmod_config->match_timeout);

    /* enable Pretended Networking mode */
    CAN_CTL0(can_periph) |= CAN_CTL0_PNMOD;
}

/*!
    \brief      configure Pretended Networking mode filter
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  expect: Pretended Networking mode struct of expected wakeup frame
                  rtr: SET, RESET
                  ide: SET, RESET
                  id: 0~0x7FF | CAN_STANDARD, or 0~0x1FFFFFFF | CAN_EXTENDED
                  dlc_high_threshold: 0~8
                  dlc_low_threshold: 0~8
                  payload[0]: 0x00000000~0xFFFFFFFF
                  payload[1]: 0x00000000~0xFFFFFFFF
    \param[in]  filter: Pretended Networking mode struct of filter data
                  remote_frame: SET, RESET
                  extended_frame: SET, RESET
                  id: 0~0x7FF | CAN_STANDARD, or 0~0x1FFFFFFF | CAN_EXTENDED. Used as id filter data, or id expected high threshold.
                  payload[0]: 0x00000000~0xFFFFFFFF. Used as payload filter data, or payload expected high threshold.
                  payload[1]: 0x00000000~0xFFFFFFFF. Used as payload filter data, or payload expected high threshold.
    \param[out] none
    \retval     none
*/
void can_pn_mode_filter_config(uint32_t can_periph, can_pn_mode_filter_struct *expect, can_pn_mode_filter_struct *filter)
{
    uint32_t reg, temp;

