wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_can.c
    /* remote frame */
    if(0U != (mdes0 & CAN_MDES0_RTR)) {
        ret = 0U;
    } else {
        /* FD frame */
        if(0U != (mdes0 & CAN_MDES0_FDF)) {
            if(dlc_value <= 15U) {
                ret = dlc_to_databytes[dlc_value];
            }
        /* classical frame */
        } else {
            if(dlc_value <= 8U) {
                ret = (uint8_t)dlc_value;
            } else {
                ret = 8U;
            }
        }
    }

    return (uint32_t)ret;
}

/*!
    \brief      swap data to little endian
    \param[in]  src: data source address
    \param[in]  len: data length be byte
    \param[out] dest: data destination address
    \retval     none
*/
static void can_data_to_little_endian_swap(uint32_t dest[], uint32_t src[], uint32_t len)
{
    volatile uint32_t i = 0U;
    uint32_t cnt;
    uint32_t temp_src = 0U;

    /* get the word length of the data */
    cnt = (len + 3U) / 4U;
    /* change each word from big endian to little endian */
    for(i = 0U; i < cnt; i++) {
        temp_src = src[i];
        dest[i] = ((uint32_t)(temp_src >> 24U) & 0x000000FFU) |
                  ((uint32_t)(temp_src >> 8U) & 0x0000FF00U) |
                  ((uint32_t)(temp_src << 8U) & 0x00FF0000U) |
                  ((uint32_t)(temp_src << 24U) & 0xFF000000U);
    }

    cnt = len % 4U;
    if(cnt) {
        dest[i - 1U] &= ((uint32_t)1U << (cnt * 8U)) - 1U;
    }
}

/*!
    \brief      swap data to big endian
    \param[in]  src: data source address
    \param[in]  len: data length be byte
    \param[out] dest: data destination address
    \retval     none
*/
static void can_data_to_big_endian_swap(uint32_t dest[], uint32_t src[], uint32_t len)
{
    volatile uint32_t i = 0U;
    uint32_t cnt;
    uint32_t temp_src = 0U;

    /* get the word length of the data */
    cnt = (len + 3U) / 4U;
    for(i = 0U; i < cnt; i++) {
        /* change each word from little endian to big endian */
        temp_src = src[i];
        dest[i] = ((uint32_t)(temp_src >> 24U) & 0x000000FFU) |
                  ((uint32_t)(temp_src >> 8U) & 0x0000FF00U) |
                  ((uint32_t)(temp_src << 8U) & 0x00FF0000U) |
                  ((uint32_t)(temp_src << 24U) & 0xFF000000U);
    }

    cnt = len % 4U;
    if(cnt) {
        dest[i - 1U] &= ~(((uint32_t)1U << ((4U - cnt) * 8U)) - 1U);
    }
}

/*!
    \brief      computes the DLC field value, given a payload size (in bytes)
    \param[in]  payload_size: payload size
    \param[out] none
    \retval     DLC value
*/
static uint32_t can_dlc_value_compute(uint32_t payload_size)
{
    uint32_t ret = 8U;

    if(payload_size <= 8U) {
        ret = payload_size;
    } else if(payload_size <= 24U) {
        ret = (payload_size - 9U) / 4U + 9U;
    } else if(payload_size <= 64U) {
        ret = (payload_size - 17U) / 16U + 13U;
    } else {
        ret = 8U;
    }

    return ret;
}
